КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектронныйЗаказНаряд/КонтурЛогистика_ЭлектронныйЗаказНаряд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ЭлектронныйЗаказНаряд</name>
  <posting>Deny</posting>
  <attributes>
    <name>УИД</name>
    <comment>Уникальный идентификатор, выданный ГИС Минтранса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗН</name>
    <comment>Должен быть уникальным в пределах Года и Организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗН</name>
    <comment>Дата оформления документа.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтователь</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтовщик</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовательПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ФрахтовщикПодразделение</name>
    <comment>Если требуется особая маршрутизация в Диадоке</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПодразделенияДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДатВрПодТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПодачи</name>
    <comment>Место подачи ТС</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияПеревозки</name>
    <comment>СвСрокВыпПрвз</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриПогрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарииВодителяПриВыгрузке</name>
    <comment>для ЗН сейчас не используется из-за отсутствия логики ПЭП водителя в сервисе</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПереадресовок</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменВодителей</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСменТС</name>
    <comment>! ТОЛЬКО ДЛЯ СОВМЕСТИМОСТИ СПИСКА ЗАДАЧ! не использовать!</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ЭлектронныйЗаказНаряд/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда 
		
		ТипДокумента = ДанныеЗаполнения.ТипДокумента;
		
		ТекстФайла = ДанныеЗаполнения.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ДанныеЗаполнения + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		Если ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ЗН_Титул1 Тогда 
			
			СодЗНИнфФт 	= XDTO.Документ.СодЗНИнфФт;
			
			УИД 	= КС.XDTO_Вычислить(СодЗНИнфФт, "УИД_ЗН");
			
			НомерЗН 	= КС.XDTO_ПолучитьЗначениеСвойства(СодЗНИнфФт, "НомерЗН");
			ДатаЗН_raw = КС.XDTO_ПолучитьЗначениеСвойства(СодЗНИнфФт, "ДатаЗН");
			ДатаЗН     = КС.Конвертировать_ДатаТип_вДата(ДатаЗН_raw);
			
			//TODO не умеем конвертить СвФт УчастникЗНФЛТип и УчастникЗНЮЛТип
			Фрахтователь 	= КС.Конвертировать_УчастникЗН_вОрганизациюДиадок(КС.XDTO_ПолучитьЗначениеСвойства(СодЗНИнфФт, "СвФт"));
			Фрахтовщик 		= ДанныеЗаполнения.Получатель;
			
			ФрахтовательПодразделение = ДанныеЗаполнения.ОтправительПодразделение;
			ФрахтовщикПодразделение = ДанныеЗаполнения.ПолучательПодразделение;
			
			МестоПодачи  			= КС.Конвертировать_АдресПользТип_вПунктМаршрутаЛогистика(КС.XDTO_ПолучитьЗначениеСвойства(СодЗНИнфФт.СвМршПодТС, "АдрМесПодТС"));
			МаршрутДатВрПодТСRAW	= КС.XDTO_Вычислить(СодЗНИнфФт, "СвМршПодТС.ДатВрПодТС");
			Если ЗначениеЗаполнено(МаршрутДатВрПодТСRAW) Тогда 
            	МаршрутДатВрПодТС	= КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(МаршрутДатВрПодТСRAW);
			КонецЕсли;
			
			Маршрут					= КС.XDTO_Вычислить(СодЗНИнфФт, "СвМршПодТС.МршПрвз.МршТекст");
			МаршрутМашиночитаемый 	= КС.XDTO_Вычислить(СодЗНИнфФт, "СвМршПодТС.МршПрвз.МршМашЧит");
			
			СрокВыполненияПеревозки	= КС.XDTO_Вычислить(СодЗНИнфФт, "СвСрокВыпПрвз");
			
		ИначеЕсли ТипДокумента = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ТрН_Титул2 Тогда 
			
		Иначе
			 Сообщить("Обработка заполнения Документа ЭТРН из " + ТипДокумента + " не поддерживается");
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
